posts/python-cookbook-readnote-2.org
#+BEGIN_COMMENT
.. title: Python Cookbook 读书笔记（二）
.. slug: python-cookbook-readnote-2
.. date: 2017-07-15
.. tags: python
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT


《[[http://shop.oreilly.com/product/0636920027072.do][Python Cookbook]]》读书笔记.
* chapter 2: Strings and Text
** 2.1. Splitting Strings on Any of Multiple Delimiters
   By us re.split and the regexp is r'[,;\s]\s*'
*** difference between str.split and re.split
    str.split only accept simple seperator
    re.split accept regulare expression.
*** return value of re.split
    1. if there are no capture group, then the same as str.split
    2. if there are capture group, then all matched data will also be returned.
       then the value will be rst[::2], the seperator will be rst[1::2]
       #+begin_src python :results output
       s = "I, you; a  seperater.   haha"
       import re
       a = re.split(r'[,;.\s]\s*', s)
       print(a)

       a = re.split(r'([,;.\s]\s*)',s)
       print(a, a[::2], a[1::2])
       #+end_src
       
       #+RESULTS:
       : ['I', 'you', 'a', 'seperater', 'haha']
       : ['I', ', ', 'you', '; ', 'a', '  ', 'seperater', '.   ', 'haha'] ['I', 'you', 'a', 'seperater', 'haha'] [', ', '; ', '  ', '.   ']
       
*** iterate on two lists, by first zip the two to one
    looks nice!
    #+begin_src python
    # Reform the line using the same delimiters
    ''.join(v+d for v,d in zip(values, delimiters))
    'asdf fjdk;afed,fjek,asdf,foo'
    #+end_src
    
    
*** regexp noncapture group, by r'(?:...)'
    
** 2.2. Matching Text at the Start or End of a String, by str.startswith() or str.endswith() method
   #+begin_src python
   filename = "aaaa.txt"
   filename.endswith(".txt")
   # pass a tuple to check against multiple choices
   filename.endswith((".c", ".h"))
   #+end_src
   
   #+begin_src python
   from urllib.request import urlopen
   def read_data(name):
       if name.startswith(('http:', 'https:', 'ftp:')):
           return urlopen(name).read()
       else:
           with open(name) as f:
               return f.read()
   #+end_src
   
   The parameter is simple string.
   
   Compared to re.match, str.startswith looks nice.
   
** 2.3. Matching Strings Using Shell Wildcard Patterns, with fnmatch.fnmatch(), fnmatch.fnmatchcase()
   Shell wildcard:
   - [] : a charset
   - * : match any length of chars
   - ? : match only one char
     
   #+begin_src python :results output
   from fnmatch import fnmatch
   print(fnmatch("data 1.txt", "*[0-9]*"))
   #+end_src
   
   #+RESULTS:
   : False
   
   1. the pattern must match the whole string
   2. compares to startswith(), fnmatch can match at any position
   3. compares to regexp, fnmatch looks nice
   4. fnmatch will use the same case-sensitive rule as the OS, fnmatchcase will always respect case.
   5. between simpe string and full power of regexp
      
      
** 2.4. Matching and Searching for Text Patterns
   What's  the difference between matching and searching
   
*** the str.find() function: find the start index of a substring
    #+begin_src python :results output
    s = "Hello xxx bbbb"
    print(s.find("xx"))
    #+end_src
    
    #+RESULTS:
    : 6
    
    
*** re.compile() function: compile a regexp strinng to a regexp object, for performance
    If you use the regexp many times, then first compile it is good. But if you only use it for one time, then don't use the compile function
    
*** difference between r'\d' and '\d'
    if the string is prefixed by  a 'r', then the '\' in the string will not be intepreted by the string parser.
    So the second regexp is actually r'd'.
    
