posts/python-cookbook-readnote-2/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Python Cookbook 读书笔记（二） | Astropeak</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
            <h1 class="site-title">
                <a href="https://astropeak.github.io/" title="Astropeak" rel="home">Astropeak</a>
            </h1>
        </div>
        <nav class="site-navigation" role="navigation"><div class="menu-toggle">
                <span class="mobile-site-title">Astropeak</span>
            </div>
            <ul class="menu">
<li><a href="../../archive.html">Archive</a></li>
                    <li><a href="../../categories/">Tags</a></li>
                    <li><a href="../../rss.xml">RSS feed</a></li>
                    <li><a href="http://github.com/astropeak">Github</a></li>
            </ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
        <div class="entry-meta">
            <span class="posted-on">
                Posted on <a href="." rel="bookmark">July 15, 2017</a>
            </span>
        </div>
        <h1>Python Cookbook 读书笔记（二）</h1>
    </div>

        <!-- Page Content -->
    <div class="site-content" role="main">
        <article class="format-standard libretto-long-form"><div class="entry-content">
                <p>
《<a href="http://shop.oreilly.com/product/0636920027072.do">Python Cookbook</a>》读书笔记.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">chapter 2: Strings and Text</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">2.1. Splitting Strings on Any of Multiple Delimiters</h3>
<div class="outline-text-3" id="text-1-1">
<p>
By us re.split and the regexp is r'[,;\s]\s*'
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">difference between str.split and re.split</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
str.split only accept simple seperator
re.split accept regulare expression.
</p>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">return value of re.split</h4>
<div class="outline-text-4" id="text-1-1-2">
<ol class="org-ol">
<li>if there are no capture group, then the same as str.split
</li>
<li>if there are capture group, then all matched data will also be returned.
then the value will be rst[::2], the seperator will be rst[1::2]
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s2">"I, you; a  seperater.   haha"</span>
<span class="kn">import</span> <span class="nn">re</span>
<span class="n">a</span> <span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">split</span><span class="p">(</span><span class="sa">r</span><span class="s1">'[,;.\s]\s*'</span><span class="p">,</span> <span class="n">s</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>

<span class="n">a</span> <span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">split</span><span class="p">(</span><span class="sa">r</span><span class="s1">'([,;.\s]\s*)'</span><span class="p">,</span><span class="n">s</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">a</span><span class="p">,</span> <span class="n">a</span><span class="p">[::</span><span class="mi">2</span><span class="p">],</span> <span class="n">a</span><span class="p">[</span><span class="mi">1</span><span class="p">::</span><span class="mi">2</span><span class="p">])</span>
</pre></div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">iterate on two lists, by first zip the two to one</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
looks nice!
</p>
<div class="highlight"><pre><span></span><span class="c1"># Reform the line using the same delimiters</span>
<span class="s1">''</span><span class="o">.</span><span class="n">join</span><span class="p">(</span><span class="n">v</span><span class="o">+</span><span class="n">d</span> <span class="k">for</span> <span class="n">v</span><span class="p">,</span><span class="n">d</span> <span class="ow">in</span> <span class="nb">zip</span><span class="p">(</span><span class="n">values</span><span class="p">,</span> <span class="n">delimiters</span><span class="p">))</span>
<span class="s1">'asdf fjdk;afed,fjek,asdf,foo'</span>
</pre></div>
</div>
</div>


<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">regexp noncapture group, by r'(?:…)'</h4>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">2.2. Matching Text at the Start or End of a String, by str.startswith() or str.endswith() method</h3>
<div class="outline-text-3" id="text-1-2">
<div class="highlight"><pre><span></span><span class="n">filename</span> <span class="o">=</span> <span class="s2">"aaaa.txt"</span>
<span class="n">filename</span><span class="o">.</span><span class="n">endswith</span><span class="p">(</span><span class="s2">".txt"</span><span class="p">)</span>
<span class="c1"># pass a tuple to check against multiple choices</span>
<span class="n">filename</span><span class="o">.</span><span class="n">endswith</span><span class="p">((</span><span class="s2">".c"</span><span class="p">,</span> <span class="s2">".h"</span><span class="p">))</span>
</pre></div>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">urllib.request</span> <span class="kn">import</span> <span class="n">urlopen</span>
<span class="k">def</span> <span class="nf">read_data</span><span class="p">(</span><span class="n">name</span><span class="p">):</span>
    <span class="k">if</span> <span class="n">name</span><span class="o">.</span><span class="n">startswith</span><span class="p">((</span><span class="s1">'http:'</span><span class="p">,</span> <span class="s1">'https:'</span><span class="p">,</span> <span class="s1">'ftp:'</span><span class="p">)):</span>
	<span class="k">return</span> <span class="n">urlopen</span><span class="p">(</span><span class="n">name</span><span class="p">)</span><span class="o">.</span><span class="n">read</span><span class="p">()</span>
    <span class="k">else</span><span class="p">:</span>
	<span class="k">with</span> <span class="nb">open</span><span class="p">(</span><span class="n">name</span><span class="p">)</span> <span class="k">as</span> <span class="n">f</span><span class="p">:</span>
	    <span class="k">return</span> <span class="n">f</span><span class="o">.</span><span class="n">read</span><span class="p">()</span>
</pre></div>

<p>
The parameter is simple string.
</p>

<p>
Compared to re.match, str.startswith looks nice.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">2.3. Matching Strings Using Shell Wildcard Patterns, with fnmatch.fnmatch(), fnmatch.fnmatchcase()</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Shell wildcard:
</p>
<ul class="org-ul">
<li>[] : a charset
</li>
<li>* : match any length of chars
</li>
<li>? : match only one char
</li>
</ul>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">fnmatch</span> <span class="kn">import</span> <span class="n">fnmatch</span>
<span class="k">print</span><span class="p">(</span><span class="n">fnmatch</span><span class="p">(</span><span class="s2">"data 1.txt"</span><span class="p">,</span> <span class="s2">"*[0-9]*"</span><span class="p">))</span>
</pre></div>

<ol class="org-ol">
<li>the pattern must match the whole string
</li>
<li>compares to startswith(), fnmatch can match at any position
</li>
<li>compares to regexp, fnmatch looks nice
</li>
<li>fnmatch will use the same case-sensitive rule as the OS, fnmatchcase will always respect case.
</li>
<li>between simpe string and full power of regexp
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">2.4. Matching and Searching for Text Patterns</h3>
<div class="outline-text-3" id="text-1-4">
<p>
What's  the difference between matching and searching
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">the str.find() function: find the start index of a substring</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s2">"Hello xxx bbbb"</span>
<span class="k">print</span><span class="p">(</span><span class="n">s</span><span class="o">.</span><span class="n">find</span><span class="p">(</span><span class="s2">"xx"</span><span class="p">))</span>
</pre></div>
</div>
</div>


<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">re.compile() function: compile a regexp strinng to a regexp object, for performance</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
If you use the regexp many times, then first compile it is good. But if you only use it for one time, then don't use the compile function
</p>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">difference between r'\d' and '\d'</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
if the string is prefixed by  a 'r', then the '\' in the string will not be intepreted by the string parser.
So the second regexp is actually r'd'.
</p>
</div>
</div>
