posts/python-cookbook-readnote-2.org
*** re.findall() function, find all matched data as a list
    #+begin_src python :results output
    text = 'Today is 11/27/2012. PyCon starts 3/13/2013.'
    import re
    rg = r'\d+/(?:\d+)/(?:\d+)'
    a = re.match('Today', text)
    print(a.group(0))
    a = re.findall(rg, text)
    print(a)
    print(type(a[0]))
    #+end_src
    
    #+RESULTS:
    : Today
    : ['11/27/2012', '3/13/2013']
    : <class 'str'>
    
    The return value: if there are capture groups, then the return value is the captured data, and if the capture group number is one, it will be  a string, else be  a tuple of strings.
    if  no capture groups, then the return value is all matched  data.
    
*** re.finditer(), find all matched data as a iterater
    Seems the return value is different from re.findall(), it will return a  matched object , the same as re.match()
    Seems strange, and highly inconsistent.
    
*** re.match() function, always match at the start of a string
*** re.match() function, return value
    rst.group(0): the matched data
    rst.group(1): the first captured data
    rst.groups(): all captured data as a tuple
    
** 2.5. Searching and Replacing Text
*** the str.replace function, replace all occurence in a string
    str.replcae(pattern, replacement)
    #+begin_src python :results output
    text = 'yeah, but no, but yeah, but no, but yeah'
    print(text.replace('yeah', 'yep'))
    # 'yep, but no, but yep, but no, but yep'
    #+end_src
    
    #+RESULTS:
    : yep, but no, but yep, but no, but yep
    
*** the re.sub(pattern, replacement, text) function, will also replace all occurence in a string
    use r'\1' to refer to the first captured group
    #+begin_src python :results output
    text = 'Today is 11/27/2012. PyCon starts 3/13/2013.'
    import re
    print(re.sub(r'(\d+)/(\d+)/(\d+)', r'\3-\1-\2', text))
    # 'Today is 2012-11-27. PyCon starts 2013-3-13.'
    #+end_src
    
    #+RESULTS:
    : Today is 2012-11-27. PyCon starts 2013-3-13.
    
*** the re.sub(pattern, callback, text) function, will also replace all occurence in a string
    The second parameter can also be a function, the parameter to this function is a match object(the  same returned by re.match function).
    
    The same example as the above one:
    #+begin_src python :results output
    text = 'Today is 11/27/2012. PyCon starts 3/13/2013.'
    import re
    def foo(m):
        (m, d, y) = m.groups()
        return '-'.join([y,m,d])

    print(re.sub(r'(\d+)/(\d+)/(\d+)', foo, text))
    #+end_src
    
    #+RESULTS:
    : Today is 2012-11-27. PyCon starts 2013-3-13.
    
    
*** the re.subn(...) function, same as re.sub, but also return subsitution counts also
** 2.6. Searching and Replacing Case-Insensitive Text
   To do case-insensitive operations, you must use regexp with the re.IGNORECASE flags keyword parameter
   
*** replace words in a string with original case preserved
    a excenlent example of replacing with 原始的大小写规则. 并且是一个很好的高阶函数的例子。
    #+begin_src python :results output
    def matchcase(word):
        def replace(m):
            text = m.group()
            if text.isupper():
                return word.upper()
            elif text.islower():
                return word.lower()
            elif text[0].isupper():
                return word.capitalize()
            else:
                return word

        return replace

    text = 'UPPER PYTHON, lower python, Mixed Python'
    import re
    print(re.sub('python', matchcase('snake'), text, flags=re.IGNORECASE))
    # 'UPPER SNAKE, lower snake, Mixed Snake'
    #+end_src
    
    #+RESULTS:
    : UPPER SNAKE, lower snake, Mixed Snake
    
** 2.7. Specifying a Regular Expression(regexp) for the Shortest Match, by using modifier '?', no-greedy match
   By default, * will match longest data. if appended with a '?' then it will match the shortest
   
   #+begin_src python :results output
   import re
   text1 = 'Computer says "no."'
   r= re.findall(r'"(.*)"', text1)
   print(r)

   text2 = 'Computer says "no." Phone says "yes."'
   r= re.findall(r'"(.*)"', text2)
   print(r)

   # Now add a '?' after '*', no greedy match
   r= re.findall(r'"(.*?)"', text2)
   print(r)
   #+end_src
   
   #+RESULTS:
   : ['no.']
   : ['no." Phone says "yes.']
   : ['no.', 'yes.']
   
