posts/python-cookbook-readnote-2/index.html

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4">re.findall() function, find all matched data as a list</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="highlight"><pre><span></span><span class="n">text</span> <span class="o">=</span> <span class="s1">'Today is 11/27/2012. PyCon starts 3/13/2013.'</span>
<span class="kn">import</span> <span class="nn">re</span>
<span class="n">rg</span> <span class="o">=</span> <span class="sa">r</span><span class="s1">'\d+/(?:\d+)/(?:\d+)'</span>
<span class="n">a</span> <span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">match</span><span class="p">(</span><span class="s1">'Today'</span><span class="p">,</span> <span class="n">text</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">a</span><span class="o">.</span><span class="n">group</span><span class="p">(</span><span class="mi">0</span><span class="p">))</span>
<span class="n">a</span> <span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">findall</span><span class="p">(</span><span class="n">rg</span><span class="p">,</span> <span class="n">text</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">a</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="nb">type</span><span class="p">(</span><span class="n">a</span><span class="p">[</span><span class="mi">0</span><span class="p">]))</span>
</pre></div>

<p>
The return value: if there are capture groups, then the return value is the captured data, and if the capture group number is one, it will be  a string, else be  a tuple of strings.
if  no capture groups, then the return value is all matched  data.
</p>
</div>
</div>

<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5">re.finditer(), find all matched data as a iterater</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Seems the return value is different from re.findall(), it will return a  matched object , the same as re.match()
Seems strange, and highly inconsistent.
</p>
</div>
</div>

<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6">re.match() function, always match at the start of a string</h4>
</div>
<div id="outline-container-sec-1-4-7" class="outline-4">
<h4 id="sec-1-4-7">re.match() function, return value</h4>
<div class="outline-text-4" id="text-1-4-7">
<p>
rst.group(0): the matched data
rst.group(1): the first captured data
rst.groups(): all captured data as a tuple
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">2.5. Searching and Replacing Text</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">the str.replace function, replace all occurence in a string</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
str.replcae(pattern, replacement)
</p>
<div class="highlight"><pre><span></span><span class="n">text</span> <span class="o">=</span> <span class="s1">'yeah, but no, but yeah, but no, but yeah'</span>
<span class="k">print</span><span class="p">(</span><span class="n">text</span><span class="o">.</span><span class="n">replace</span><span class="p">(</span><span class="s1">'yeah'</span><span class="p">,</span> <span class="s1">'yep'</span><span class="p">))</span>
<span class="c1"># 'yep, but no, but yep, but no, but yep'</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">the re.sub(pattern, replacement, text) function, will also replace all occurence in a string</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
use r'\1' to refer to the first captured group
</p>
<div class="highlight"><pre><span></span><span class="n">text</span> <span class="o">=</span> <span class="s1">'Today is 11/27/2012. PyCon starts 3/13/2013.'</span>
<span class="kn">import</span> <span class="nn">re</span>
<span class="k">print</span><span class="p">(</span><span class="n">re</span><span class="o">.</span><span class="n">sub</span><span class="p">(</span><span class="sa">r</span><span class="s1">'(\d+)/(\d+)/(\d+)'</span><span class="p">,</span> <span class="sa">r</span><span class="s1">'\3-\1-\2'</span><span class="p">,</span> <span class="n">text</span><span class="p">))</span>
<span class="c1"># 'Today is 2012-11-27. PyCon starts 2013-3-13.'</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3">the re.sub(pattern, callback, text) function, will also replace all occurence in a string</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
The second parameter can also be a function, the parameter to this function is a match object(the  same returned by re.match function).
</p>

<p>
The same example as the above one:
</p>
<div class="highlight"><pre><span></span><span class="n">text</span> <span class="o">=</span> <span class="s1">'Today is 11/27/2012. PyCon starts 3/13/2013.'</span>
<span class="kn">import</span> <span class="nn">re</span>
<span class="k">def</span> <span class="nf">foo</span><span class="p">(</span><span class="n">m</span><span class="p">):</span>
    <span class="p">(</span><span class="n">m</span><span class="p">,</span> <span class="n">d</span><span class="p">,</span> <span class="n">y</span><span class="p">)</span> <span class="o">=</span> <span class="n">m</span><span class="o">.</span><span class="n">groups</span><span class="p">()</span>
    <span class="k">return</span> <span class="s1">'-'</span><span class="o">.</span><span class="n">join</span><span class="p">([</span><span class="n">y</span><span class="p">,</span><span class="n">m</span><span class="p">,</span><span class="n">d</span><span class="p">])</span>

<span class="k">print</span><span class="p">(</span><span class="n">re</span><span class="o">.</span><span class="n">sub</span><span class="p">(</span><span class="sa">r</span><span class="s1">'(\d+)/(\d+)/(\d+)'</span><span class="p">,</span> <span class="n">foo</span><span class="p">,</span> <span class="n">text</span><span class="p">))</span>
</pre></div>
</div>
</div>


<div id="outline-container-sec-1-5-4" class="outline-4">
<h4 id="sec-1-5-4">the re.subn(…) function, same as re.sub, but also return subsitution counts also</h4>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">2.6. Searching and Replacing Case-Insensitive Text</h3>
<div class="outline-text-3" id="text-1-6">
<p>
To do case-insensitive operations, you must use regexp with the re.IGNORECASE flags keyword parameter
</p>
</div>

<div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">replace words in a string with original case preserved</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
a excenlent example of replacing with 原始的大小写规则. 并且是一个很好的高阶函数的例子。
</p>
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="nf">matchcase</span><span class="p">(</span><span class="n">word</span><span class="p">):</span>
    <span class="k">def</span> <span class="nf">replace</span><span class="p">(</span><span class="n">m</span><span class="p">):</span>
	<span class="n">text</span> <span class="o">=</span> <span class="n">m</span><span class="o">.</span><span class="n">group</span><span class="p">()</span>
	<span class="k">if</span> <span class="n">text</span><span class="o">.</span><span class="n">isupper</span><span class="p">():</span>
	    <span class="k">return</span> <span class="n">word</span><span class="o">.</span><span class="n">upper</span><span class="p">()</span>
	<span class="k">elif</span> <span class="n">text</span><span class="o">.</span><span class="n">islower</span><span class="p">():</span>
	    <span class="k">return</span> <span class="n">word</span><span class="o">.</span><span class="n">lower</span><span class="p">()</span>
	<span class="k">elif</span> <span class="n">text</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span><span class="o">.</span><span class="n">isupper</span><span class="p">():</span>
	    <span class="k">return</span> <span class="n">word</span><span class="o">.</span><span class="n">capitalize</span><span class="p">()</span>
	<span class="k">else</span><span class="p">:</span>
	    <span class="k">return</span> <span class="n">word</span>

    <span class="k">return</span> <span class="n">replace</span>

<span class="n">text</span> <span class="o">=</span> <span class="s1">'UPPER PYTHON, lower python, Mixed Python'</span>
<span class="kn">import</span> <span class="nn">re</span>
<span class="k">print</span><span class="p">(</span><span class="n">re</span><span class="o">.</span><span class="n">sub</span><span class="p">(</span><span class="s1">'python'</span><span class="p">,</span> <span class="n">matchcase</span><span class="p">(</span><span class="s1">'snake'</span><span class="p">),</span> <span class="n">text</span><span class="p">,</span> <span class="n">flags</span><span class="o">=</span><span class="n">re</span><span class="o">.</span><span class="n">IGNORECASE</span><span class="p">))</span>
<span class="c1"># 'UPPER SNAKE, lower snake, Mixed Snake'</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">2.7. Specifying a Regular Expression(regexp) for the Shortest Match, by using modifier '?', no-greedy match</h3>
<div class="outline-text-3" id="text-1-7">
<p>
By default, * will match longest data. if appended with a '?' then it will match the shortest
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">re</span>
<span class="n">text1</span> <span class="o">=</span> <span class="s1">'Computer says "no."'</span>
<span class="n">r</span><span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">findall</span><span class="p">(</span><span class="sa">r</span><span class="s1">'"(.*)"'</span><span class="p">,</span> <span class="n">text1</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">r</span><span class="p">)</span>

<span class="n">text2</span> <span class="o">=</span> <span class="s1">'Computer says "no." Phone says "yes."'</span>
<span class="n">r</span><span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">findall</span><span class="p">(</span><span class="sa">r</span><span class="s1">'"(.*)"'</span><span class="p">,</span> <span class="n">text2</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">r</span><span class="p">)</span>

<span class="c1"># Now add a '?' after '*', no greedy match</span>
<span class="n">r</span><span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">findall</span><span class="p">(</span><span class="sa">r</span><span class="s1">'"(.*?)"'</span><span class="p">,</span> <span class="n">text2</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">r</span><span class="p">)</span>
</pre></div>
</div>
</div>
