posts/python-cookbook-readnote-2.org
** 2.8. Writing a Regular Expression for Multiline Patterns
   By default, '.' will not match a new line character. 
   there are two choices to let '.' match a new line character:
   1. by alternative.
      change r'.*' to r'(?:.|\n)*'
   2. by use the re.DOTALL flag
      #+begin_src python :results output
      s = '''/* aaaa
      bbbb
      cccc */'''
      import re
      r = re.findall(r'/\*.*\*/', s, flags=re.DOTALL)
      r = re.findall(r'/\*(?:.|\n)*\*/', s, flags=re.DOTALL)
      print(r)
      #+end_src
      
      #+RESULTS:
      : ['/* aaaa\nbbbb\ncccc */']
      
*** the re.DOTALL flag: let '.' match a newline character
** 2.9. Normalizing Unicode Text to a Standard Representation, by unicodedata.normalize('NFC', str)
   unicode may have more than one representation, see example in the book
*** normalizing means make sth. has the uniform format/type
** 2.11. Stripping Unwanted Characters from Strings
*** str.strip() function. lstrip(), rstrip(), delete whitespaces characters at begining or ending
    #+begin_src python :results output
    s = "    a b c \n ";
    print(s.strip())
    print(s.lstrip())
    print(s.rstrip())
    #+end_src
    
    #+RESULTS:
    : a b c
    : a b c 
    :  
    :     a b c
*** delete characters in middle of string, by str.replace(), or re.sub()
    #+begin_src python :results output
    s = "   hello     word    ";
    print(s.replace(" ", ""))
    import re
    print(re.sub("\s+", " ", s))
    #+end_src
    
    #+RESULTS:
    : helloword
    :  hello word 
*** create a generator object  by an expression, by '(' instead of '[', like lazy evaluation on other languages
    #+begin_src python :results output
    s = '''
    import os.path
    rst = ""
    if os.path.isfile(""):
        with open("", "r") as f:
            rst = f.read()
    '''
    ss = s.split("\n")

    s1 = (s.strip() for s in ss)
    print(s1)
    for s in s1:
        print(s)
    #+end_src
    
    #+RESULTS:
    : <generator object <genexpr> at 0x00000048B4AAF0F8>
    : 
    : import os.path
    : rst = ""
    : if os.path.isfile(""): 
    : with open("", "r") as f: 
    : rst = f.read()
    : 
    
** 2.12. Sanitizing and Cleaning Up Text
*** str.translate() function, change characters given a table/dictionary, the book given much unicode examples
    
** 2.13. Aligning Text Strings
   
*** the str.ljust(), str.rjust(), str.center() functions
    accept a number, and an optionall character
    #+begin_src python :results output
print("aaa".ljust(20, "b"))
print("aaa".rjust(20, "-"))
print("aaa".center(20, "="))
print("aaa".center(20))
    #+end_src
    
    #+RESULTS:
    : aaabbbbbbbbbbbbbbbbb
    : -----------------aaa
    : ========aaa=========
    :         aaa         
    
*** the format function and the str.format methods
    #+begin_src python :results output
print(format("aaa", ">20")) # same as rjust
print(format("aaa", "=<20")) # same as ljust
print(format("aaa", "^20")) # same as center
    #+end_src
    
    #+RESULTS:
    :                  aaa
    : aaa=================
    :         aaa         
    
    #+begin_src python :results output
print("{} {:=^10}".format("abc", 123))
    #+end_src
    
    #+RESULTS:
    : abc ===123====
    
    
    
    
    
    "%s %s" % (a, b) is old way, now should use the new way.
    
    
** 2.14. Combining and Concatenating Strings
   
*** by str.join
    
*** by + operator
    
*** by print function's 'sep' parameter
    
*** by format function
** 2.15. Interpolating Variables in Strings, by str.format() or str.format_map() method
   Note: format_map doesn't exist in python 2.7
   #+begin_src python :results output
   print("{name} is {age} years old".format(name="Tom", age=16))

   name = "Jim"
   age = 18
   # print("{name} is {age} years old".format_map(vars()))
   #+end_src
   
   #+RESULTS:
   : Tom is 16 years old


   format_map accept a dictionay, while format accept keywords parameters
*** the vars() function, the same as locals() if no parameter
    if pass one parameter, then it is the same as obj.__dict__
    #+begin_src python :results output
    s = 'abc'
    d = 123
    print(vars())
    print(locals())
    # print(vars(s))
    #+end_src

    #+RESULTS:
