posts/python-cookbook-readnote-2/index.html

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">2.8. Writing a Regular Expression for Multiline Patterns</h3>
<div class="outline-text-3" id="text-1-8">
<p>
By default, '.' will not match a new line character. 
there are two choices to let '.' match a new line character:
</p>
<ol class="org-ol">
<li>by alternative.
change r'.*' to r'(?:.|\n)*'
</li>
<li>by use the re.DOTALL flag
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s1">'''/* aaaa</span>
<span class="s1">bbbb</span>
<span class="s1">cccc */'''</span>
<span class="kn">import</span> <span class="nn">re</span>
<span class="n">r</span> <span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">findall</span><span class="p">(</span><span class="sa">r</span><span class="s1">'/\*.*\*/'</span><span class="p">,</span> <span class="n">s</span><span class="p">,</span> <span class="n">flags</span><span class="o">=</span><span class="n">re</span><span class="o">.</span><span class="n">DOTALL</span><span class="p">)</span>
<span class="n">r</span> <span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">findall</span><span class="p">(</span><span class="sa">r</span><span class="s1">'/\*(?:.|\n)*\*/'</span><span class="p">,</span> <span class="n">s</span><span class="p">,</span> <span class="n">flags</span><span class="o">=</span><span class="n">re</span><span class="o">.</span><span class="n">DOTALL</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">r</span><span class="p">)</span>
</pre></div>
</li>
</ol>
</div>

<div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1">the re.DOTALL flag: let '.' match a newline character</h4>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">2.9. Normalizing Unicode Text to a Standard Representation, by unicodedata.normalize('NFC', str)</h3>
<div class="outline-text-3" id="text-1-9">
<p>
unicode may have more than one representation, see example in the book
</p>
</div>
<div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1">normalizing means make sth. has the uniform format/type</h4>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">2.11. Stripping Unwanted Characters from Strings</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<div id="outline-container-sec-1-10-1" class="outline-4">
<h4 id="sec-1-10-1">str.strip() function. lstrip(), rstrip(), delete whitespaces characters at begining or ending</h4>
<div class="outline-text-4" id="text-1-10-1">
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s2">"    a b c </span><span class="se">\n</span><span class="s2"> "</span><span class="p">;</span>
<span class="k">print</span><span class="p">(</span><span class="n">s</span><span class="o">.</span><span class="n">strip</span><span class="p">())</span>
<span class="k">print</span><span class="p">(</span><span class="n">s</span><span class="o">.</span><span class="n">lstrip</span><span class="p">())</span>
<span class="k">print</span><span class="p">(</span><span class="n">s</span><span class="o">.</span><span class="n">rstrip</span><span class="p">())</span>
</pre></div>
<p>
<b>*</b> delete characters in middle of string, by str.replace(), or re.sub()
</p>
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s2">"   hello     word    "</span><span class="p">;</span>
<span class="k">print</span><span class="p">(</span><span class="n">s</span><span class="o">.</span><span class="n">replace</span><span class="p">(</span><span class="s2">" "</span><span class="p">,</span> <span class="s2">""</span><span class="p">))</span>
<span class="kn">import</span> <span class="nn">re</span>
<span class="k">print</span><span class="p">(</span><span class="n">re</span><span class="o">.</span><span class="n">sub</span><span class="p">(</span><span class="s2">"\s+"</span><span class="p">,</span> <span class="s2">" "</span><span class="p">,</span> <span class="n">s</span><span class="p">))</span>
</pre></div>
<p>
<b>*</b> create a generator object  by an expression, by '(' instead of '[', like lazy evaluation on other languages
</p>
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s1">'''</span>
<span class="s1">import os.path</span>
<span class="s1">rst = ""</span>
<span class="s1">if os.path.isfile(""):</span>
<span class="s1">    with open("", "r") as f:</span>
<span class="s1">	rst = f.read()</span>
<span class="s1">'''</span>
<span class="n">ss</span> <span class="o">=</span> <span class="n">s</span><span class="o">.</span><span class="n">split</span><span class="p">(</span><span class="s2">"</span><span class="se">\n</span><span class="s2">"</span><span class="p">)</span>

<span class="n">s1</span> <span class="o">=</span> <span class="p">(</span><span class="n">s</span><span class="o">.</span><span class="n">strip</span><span class="p">()</span> <span class="k">for</span> <span class="n">s</span> <span class="ow">in</span> <span class="n">ss</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">s1</span><span class="p">)</span>
<span class="k">for</span> <span class="n">s</span> <span class="ow">in</span> <span class="n">s1</span><span class="p">:</span>
    <span class="k">print</span><span class="p">(</span><span class="n">s</span><span class="p">)</span>
</pre></div>
</div>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">2.12. Sanitizing and Cleaning Up Text</h3>
<div class="outline-text-3" id="text-1-11">
</div>
<div id="outline-container-sec-1-11-1" class="outline-4">
<h4 id="sec-1-11-1">str.translate() function, change characters given a table/dictionary, the book given much unicode examples</h4>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12">2.13. Aligning Text Strings</h3>
<div class="outline-text-3" id="text-1-12">
</div>
<div id="outline-container-sec-1-12-1" class="outline-4">
<h4 id="sec-1-12-1">the str.ljust(), str.rjust(), str.center() functions</h4>
<div class="outline-text-4" id="text-1-12-1">
<p>
accept a number, and an optionall character
</p>
<div class="highlight"><pre><span></span><span class="k">print</span><span class="p">(</span><span class="s2">"aaa"</span><span class="o">.</span><span class="n">ljust</span><span class="p">(</span><span class="mi">20</span><span class="p">,</span> <span class="s2">"b"</span><span class="p">))</span>
<span class="k">print</span><span class="p">(</span><span class="s2">"aaa"</span><span class="o">.</span><span class="n">rjust</span><span class="p">(</span><span class="mi">20</span><span class="p">,</span> <span class="s2">"-"</span><span class="p">))</span>
<span class="k">print</span><span class="p">(</span><span class="s2">"aaa"</span><span class="o">.</span><span class="n">center</span><span class="p">(</span><span class="mi">20</span><span class="p">,</span> <span class="s2">"="</span><span class="p">))</span>
<span class="k">print</span><span class="p">(</span><span class="s2">"aaa"</span><span class="o">.</span><span class="n">center</span><span class="p">(</span><span class="mi">20</span><span class="p">))</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-1-12-2" class="outline-4">
<h4 id="sec-1-12-2">the format function and the str.format methods</h4>
<div class="outline-text-4" id="text-1-12-2">
<div class="highlight"><pre><span></span><span class="k">print</span><span class="p">(</span><span class="n">format</span><span class="p">(</span><span class="s2">"aaa"</span><span class="p">,</span> <span class="s2">"&gt;20"</span><span class="p">))</span> <span class="c1"># same as rjust</span>
<span class="k">print</span><span class="p">(</span><span class="n">format</span><span class="p">(</span><span class="s2">"aaa"</span><span class="p">,</span> <span class="s2">"=&lt;20"</span><span class="p">))</span> <span class="c1"># same as ljust</span>
<span class="k">print</span><span class="p">(</span><span class="n">format</span><span class="p">(</span><span class="s2">"aaa"</span><span class="p">,</span> <span class="s2">"^20"</span><span class="p">))</span> <span class="c1"># same as center</span>
</pre></div>

<div class="highlight"><pre><span></span><span class="k">print</span><span class="p">(</span><span class="s2">"{} {:=^10}"</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="s2">"abc"</span><span class="p">,</span> <span class="mi">123</span><span class="p">))</span>
</pre></div>





<p>
"%s %s" % (a, b) is old way, now should use the new way.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13">2.14. Combining and Concatenating Strings</h3>
<div class="outline-text-3" id="text-1-13">
</div>
<div id="outline-container-sec-1-13-1" class="outline-4">
<h4 id="sec-1-13-1">by str.join</h4>
</div>

<div id="outline-container-sec-1-13-2" class="outline-4">
<h4 id="sec-1-13-2">by + operator</h4>
</div>

<div id="outline-container-sec-1-13-3" class="outline-4">
<h4 id="sec-1-13-3">by print function's 'sep' parameter</h4>
</div>

<div id="outline-container-sec-1-13-4" class="outline-4">
<h4 id="sec-1-13-4">by format function</h4>
</div>
</div>
<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14">2.15. Interpolating Variables in Strings, by str.format() or str.format<sub>map</sub>() method</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Note: format<sub>map</sub> doesn't exist in python 2.7
</p>
<div class="highlight"><pre><span></span><span class="k">print</span><span class="p">(</span><span class="s2">"{name} is {age} years old"</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">name</span><span class="o">=</span><span class="s2">"Tom"</span><span class="p">,</span> <span class="n">age</span><span class="o">=</span><span class="mi">16</span><span class="p">))</span>

<span class="n">name</span> <span class="o">=</span> <span class="s2">"Jim"</span>
<span class="n">age</span> <span class="o">=</span> <span class="mi">18</span>
<span class="c1"># print("{name} is {age} years old".format_map(vars()))</span>
</pre></div>


<p>
format<sub>map</sub> accept a dictionay, while format accept keywords parameters
</p>
</div>
<div id="outline-container-sec-1-14-1" class="outline-4">
<h4 id="sec-1-14-1">the vars() function, the same as locals() if no parameter</h4>
<div class="outline-text-4" id="text-1-14-1">
<p>
if pass one parameter, then it is the same as obj._<sub>dict</sub>__
</p>
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s1">'abc'</span>
<span class="n">d</span> <span class="o">=</span> <span class="mi">123</span>
<span class="k">print</span><span class="p">(</span><span class="nb">vars</span><span class="p">())</span>
<span class="k">print</span><span class="p">(</span><span class="nb">locals</span><span class="p">())</span>
<span class="c1"># print(vars(s))</span>
</pre></div>
</div>
</div>
