posts/python-cookbook-readnote-2.org
*** the dict.__missing__(self, key) method will be called when a key not exists, then KeyError will not be raised.
    If this method is defined, then when a key not exists, it will be called and return the value. Else a KeyError will be raised.
    #+begin_src python :results output
    class safedict(dict):
        def __missing__(self, key):
            return '{'+key+'}'

    d = safedict();
    print(d['name'])
    d1 = dict();
    # print(d1['name'])
    #+end_src

    #+RESULTS:
    : {name}
*** a function that will do variable interpolating from env, just like $var in perl, by str.format_map
    #+begin_src python :results output
    class safedict(dict):
        def __missing__(self, key):
            return '{'+key+'}'


    import sys
    def sub(text):
        return text.format_map(safedict(sys._getframe(1).f_locals))

    name="Jim"
    age=18
    print(sub("{name} is {age} years old"))
    #+end_src

    #+RESULTS:
    : Jim is 18 years old


    #+begin_src python :results output
    people = {
       'name': ['John', 'Peter'],
       'age': [56, 64]
    }

    for i in range(2):
        print('My name is {{name[{0}]}}, I am {{age[{0}]}} years old.'.format(i).format_map(people))
    #+end_src

    #+RESULTS:
    : My name is John, I am 56 years old.
    : My name is Peter, I am 64 years old.
*** sys._getframe([depth]): like calls in perl, get the stack frame
    depth default to 0, means current stack frame. 
    f_locals attribute is used to get all local variabls.
    f_lineno attribute is the line number.
    #+begin_src python :results output
    import sys
    print(sys._getframe().f_locals)
    print(sys._getframe().f_globals)
    print(dir(sys._getframe().f_code))
    print(sys._getframe().f_code.co_filename)
    print(sys._getframe().f_lineno)
    #+end_src

    #+RESULTS:
    : {'__name__': '__main__', '__doc__': None, '__package__': None, '__loader__': <class '_frozen_importlib.BuiltinImporter'>, '__spec__': None, '__annotations__': {}, '__builtins__': <module 'builtins' (built-in)>, '__file__': '<stdin>', '__cached__': None, 'sys': <module 'sys' (built-in)>}
    : {'__name__': '__main__', '__doc__': None, '__package__': None, '__loader__': <class '_frozen_importlib.BuiltinImporter'>, '__spec__': None, '__annotations__': {}, '__builtins__': <module 'builtins' (built-in)>, '__file__': '<stdin>', '__cached__': None, 'sys': <module 'sys' (built-in)>}
    : ['__class__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'co_argcount', 'co_cellvars', 'co_code', 'co_consts', 'co_filename', 'co_firstlineno', 'co_flags', 'co_freevars', 'co_kwonlyargcount', 'co_lnotab', 'co_name', 'co_names', 'co_nlocals', 'co_stacksize', 'co_varnames']
    : <stdin>
    : 6

    
** 2.16. Reformatting Text to a Fixed Number of Columns, by textwrap.fill(astr, columns, initial_indent='', subsquent_indent='')
   #+begin_src python :results output
   import textwrap
   s = "Look into my eyes, look into my eyes, the eyes, the eyes, \
   the eyes, not around the eyes, don't look around the eyes, \
   look into my eyes, you're under."

   print(s)
   print(textwrap.fill(s, 60))
   #+end_src

   #+RESULTS:
   : Look into my eyes, look into my eyes, the eyes, the eyes, the eyes, not around the eyes, don't look around the eyes, look into my eyes, you're under.
   : Look into my eyes, look into my eyes, the eyes, the eyes,
   : the eyes, not around the eyes, don't look around the eyes,
   : look into my eyes, you're under.

*** get terminal column size, by os.get_terminal_size().columns
    #+begin_src python :results output
    import os
    print(os.get_terminal_size().columns)
    #+end_src

    #+RESULTS:


** 2.17. Handling HTML and XML Entities in Text
*** the html.escape(astr, quote=True) function: 
    escape means convert special characters to 
    #+begin_src python :results output
    s = '<a>this is </a>'
    import html
    print(html.escape(s))
    #+end_src

    #+RESULTS:
    : &lt;a&gt;this is = &lt;/a&gt;
*** the str.encode('ascii', errors='xmlcharrefreplace') function: encode a string to ascii
    #+begin_src python :results output
    s = 'Spicy Jalapeño'
    print(s.encode('ascii', errors='xmlcharrefreplace'))
    #+end_src

    #+RESULTS:
    : b'Spicy Jalape&#241;o'

