posts/python-cookbook-readnote-2/index.html
<div id="outline-container-sec-1-14-2" class="outline-4">
<h4 id="sec-1-14-2">the dict._<sub>missing</sub>_<sub>(self, key)</sub> method will be called when a key not exists, then KeyError will not be raised.</h4>
<div class="outline-text-4" id="text-1-14-2">
<p>
If this method is defined, then when a key not exists, it will be called and return the value. Else a KeyError will be raised.
</p>
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">safedict</span><span class="p">(</span><span class="nb">dict</span><span class="p">):</span>
    <span class="k">def</span> <span class="fm">__missing__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">key</span><span class="p">):</span>
	<span class="k">return</span> <span class="s1">'{'</span><span class="o">+</span><span class="n">key</span><span class="o">+</span><span class="s1">'}'</span>

<span class="n">d</span> <span class="o">=</span> <span class="n">safedict</span><span class="p">();</span>
<span class="k">print</span><span class="p">(</span><span class="n">d</span><span class="p">[</span><span class="s1">'name'</span><span class="p">])</span>
<span class="n">d1</span> <span class="o">=</span> <span class="nb">dict</span><span class="p">();</span>
<span class="c1"># print(d1['name'])</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-1-14-3" class="outline-4">
<h4 id="sec-1-14-3">a function that will do variable interpolating from env, just like $var in perl, by str.format<sub>map</sub>
</h4>
<div class="outline-text-4" id="text-1-14-3">
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">safedict</span><span class="p">(</span><span class="nb">dict</span><span class="p">):</span>
    <span class="k">def</span> <span class="fm">__missing__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">key</span><span class="p">):</span>
	<span class="k">return</span> <span class="s1">'{'</span><span class="o">+</span><span class="n">key</span><span class="o">+</span><span class="s1">'}'</span>


<span class="kn">import</span> <span class="nn">sys</span>
<span class="k">def</span> <span class="nf">sub</span><span class="p">(</span><span class="n">text</span><span class="p">):</span>
    <span class="k">return</span> <span class="n">text</span><span class="o">.</span><span class="n">format_map</span><span class="p">(</span><span class="n">safedict</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">_getframe</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span><span class="o">.</span><span class="n">f_locals</span><span class="p">))</span>

<span class="n">name</span><span class="o">=</span><span class="s2">"Jim"</span>
<span class="n">age</span><span class="o">=</span><span class="mi">18</span>
<span class="k">print</span><span class="p">(</span><span class="n">sub</span><span class="p">(</span><span class="s2">"{name} is {age} years old"</span><span class="p">))</span>
</pre></div>


<div class="highlight"><pre><span></span><span class="n">people</span> <span class="o">=</span> <span class="p">{</span>
   <span class="s1">'name'</span><span class="p">:</span> <span class="p">[</span><span class="s1">'John'</span><span class="p">,</span> <span class="s1">'Peter'</span><span class="p">],</span>
   <span class="s1">'age'</span><span class="p">:</span> <span class="p">[</span><span class="mi">56</span><span class="p">,</span> <span class="mi">64</span><span class="p">]</span>
<span class="p">}</span>

<span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="mi">2</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'My name is {{name[{0}]}}, I am {{age[{0}]}} years old.'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">i</span><span class="p">)</span><span class="o">.</span><span class="n">format_map</span><span class="p">(</span><span class="n">people</span><span class="p">))</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-1-14-4" class="outline-4">
<h4 id="sec-1-14-4">sys.<sub>getframe</sub>([depth]): like calls in perl, get the stack frame</h4>
<div class="outline-text-4" id="text-1-14-4">
<p>
depth default to 0, means current stack frame. 
f<sub>locals</sub> attribute is used to get all local variabls.
f<sub>lineno</sub> attribute is the line number.
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">sys</span>
<span class="k">print</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">_getframe</span><span class="p">()</span><span class="o">.</span><span class="n">f_locals</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">_getframe</span><span class="p">()</span><span class="o">.</span><span class="n">f_globals</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="nb">dir</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">_getframe</span><span class="p">()</span><span class="o">.</span><span class="n">f_code</span><span class="p">))</span>
<span class="k">print</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">_getframe</span><span class="p">()</span><span class="o">.</span><span class="n">f_code</span><span class="o">.</span><span class="n">co_filename</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">_getframe</span><span class="p">()</span><span class="o">.</span><span class="n">f_lineno</span><span class="p">)</span>
</pre></div>
</div>
</div>
</div>


<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15">2.16. Reformatting Text to a Fixed Number of Columns, by textwrap.fill(astr, columns, initial<sub>indent</sub>='', subsquent<sub>indent</sub>='')</h3>
<div class="outline-text-3" id="text-1-15">
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">textwrap</span>
<span class="n">s</span> <span class="o">=</span> <span class="s2">"Look into my eyes, look into my eyes, the eyes, the eyes, </span><span class="se">\</span>
<span class="s2">the eyes, not around the eyes, don't look around the eyes, </span><span class="se">\</span>
<span class="s2">look into my eyes, you're under."</span>

<span class="k">print</span><span class="p">(</span><span class="n">s</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">textwrap</span><span class="o">.</span><span class="n">fill</span><span class="p">(</span><span class="n">s</span><span class="p">,</span> <span class="mi">60</span><span class="p">))</span>
</pre></div>
</div>

<div id="outline-container-sec-1-15-1" class="outline-4">
<h4 id="sec-1-15-1">get terminal column size, by os.get<sub>terminal</sub><sub>size</sub>().columns</h4>
<div class="outline-text-4" id="text-1-15-1">
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">os</span>
<span class="k">print</span><span class="p">(</span><span class="n">os</span><span class="o">.</span><span class="n">get_terminal_size</span><span class="p">()</span><span class="o">.</span><span class="n">columns</span><span class="p">)</span>
</pre></div>
</div>
</div>
</div>


<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16">2.17. Handling HTML and XML Entities in Text</h3>
<div class="outline-text-3" id="text-1-16">
</div>
<div id="outline-container-sec-1-16-1" class="outline-4">
<h4 id="sec-1-16-1">the html.escape(astr, quote=True) function:</h4>
<div class="outline-text-4" id="text-1-16-1">
<p>
escape means convert special characters to 
</p>
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s1">'&lt;a&gt;this is &lt;/a&gt;'</span>
<span class="kn">import</span> <span class="nn">html</span>
<span class="k">print</span><span class="p">(</span><span class="n">html</span><span class="o">.</span><span class="n">escape</span><span class="p">(</span><span class="n">s</span><span class="p">))</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-1-16-2" class="outline-4">
<h4 id="sec-1-16-2">the str.encode('ascii', errors='xmlcharrefreplace') function: encode a string to ascii</h4>
<div class="outline-text-4" id="text-1-16-2">
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="o">=</span> <span class="s1">'Spicy Jalapeño'</span>
<span class="k">print</span><span class="p">(</span><span class="n">s</span><span class="o">.</span><span class="n">encode</span><span class="p">(</span><span class="s1">'ascii'</span><span class="p">,</span> <span class="n">errors</span><span class="o">=</span><span class="s1">'xmlcharrefreplace'</span><span class="p">))</span>
</pre></div>
</div>
</div>
</div>
</div>
            </div>
        </article>
</div>

        <!-- Tag Section -->
    <div class="site-content navigation-post">
        <div class="tag-head">Tags</div>
        <div class="tag-list">
                <a href="../../categories/python/">python</a>
        </div>
    </div>

        <!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
            <a href="../python-cookbook-readnote-1/" rel="prev">
                <span class="meta-nav">Older Post</span>Python Cookbook 读书笔记（一）
            </a>
        </div>
        <div class="next">
            <a href="../python-cookbook-readnote-3/" rel="next">
                <span class="meta-nav">Newer Post</span>Python Cookbook 读书笔记（三）
            </a>
        </div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
            <aside class="widget"><h2 class="widget-title">Astropeak</h2>
                <div class="widget-text">Astropeak's blogs.</div>
            </aside>
</div>
    </section><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
            <p>Contents © 2018         <a href="mailto:astropeak@gmail.com">Astropeak</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
        </div>
        <div class="social">
            <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>
